<template>
	<view class="cu-modal" :class="showModalName== modalName ?'show':''" :style="'margin-top:'+CustomBar+ 'px'">
		<view class="cu-dialog">
			<view class="cu-bar bg-white justify-end">
				<view class="content">设计复杂程度调整</view>
				<view class="action" @tap="hideModal">
					<text class="cuIcon-close text-red"></text>
				</view>
			</view>
			<view class="padding-xl">
				<uni-collapse animation="outer" accordion="true" @change="change">
					<uni-collapse-item v-for="(item,index) in dataList" :key="index" :title="item">
						<view style="display: flex;flex-wrap: wrap;" v-if="checkOpen >= 1">
							<view v-for="(i,j) in data[isactive].list" :key="j">
								<view class="p-2 bnb ml-2" 
									:class="clickIndex == j ? 'active' : ''"
									@click="addClass(j)"
								>{{i.category}}</view>
							</view>
							<view class="dlf-group lt">
								<view class="w-100 dlf-li font lt border-b"
											v-for="(m, k) in data[isactive].list[clickIndex].chilren"
											:key="k" 
											@tap="assignment"
											:data-val="m.level"
											:data-key="k"
											data-index="index0"
											>
									<view  style=" white-space: pre-wrap;">
										<view class=" iconBLue" style="font-size: 30rpx;">{{m.level}}</view>
										<view v-for="(x,y) in m.son" :key="y">
											<view>{{x}}</view>
										</view>
									</view>
								</view>
							</view>
						</view>
					</uni-collapse-item>
				</uni-collapse>
			</view>
		</view>
	</view>
</template>

<script>
	import {
		uniCollapse,
		uniCollapseItem
	} from "@dcloudio/uni-ui"
	import {modalMixin} from "@/common/base/modalMixin"
	
	export default {
		mixins: [modalMixin],
		props: {
			showModalName: {
				type: String,
				default: null
			}, // 弹框可见标志
		},
		data() {
			return {
				isactive: 0 ,
				clickIndex: 0,
				modalName:'sjfJi_fztz',
				CustomBar:this.CustomBar,
				data:[
					{
						list:[
							{
								category:'坑内采矿',
								chilren:[
									{
										level:'I级',
										son:[
											'1.地形、地质、水文条件简单,',
											'2.开拓运输系统单一，斜井串车，平硐溜井，主、副、风井条数≤3条,',
											'3.矿石品种单一，不分采的采矿工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1.地形、地质、水文条件较复杂,',
											'2.缓倾斜薄矿体或埋藏深度＞500m的矿体,',
											'3.开拓运输系统较复杂，斜井箕斗，主、副、风井条数≥4条，有系统的顶板管理设施,',
											'4.两种矿石品种，有分采、分贮、分运设施的采矿工程,',
										]
									},
									{
										level: 'III级',
										son:[
											'1.地形、地质、水文条件复杂,',
											'2.缓倾斜中厚矿体或大水矿床,',
											'3.开拓运输系统复杂，斜井胶带，联合开拓运输系统，有复杂的疏干、排水系统及设施,',
											'4.两种以上矿石品种，有分采、分贮、分运设施，采用充填采矿法或特殊采矿法的各类采矿工程,',
											'5.铀矿采矿工程,',
										]
									}
								]
							},
							{
								category: '露天采矿',
								chilren:[
									{
										level:'I级',
										son:[
											'1.地形、地质、水文条件简单,',
											'2.矿体埋藏垂深＜120m的山坡与深凹露天矿,',
											'3.单一采场的一般露天矿，开拓运输系统单一,',
											'4.矿石品种单一，不分采的采矿工程,',
											'5.水深＜6m采金船采金工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1.地形、地质、水文条件较复杂,',
											'2.矿体埋藏垂深≥120m的深凹露天矿,',
											'3.多采场的露天矿，两种以上开拓运输方式,',
											'4.两种矿石品种，有分采、分贮、分运设施的采矿工程,',
											'5.水深6～9m采金船采金工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1.地形、地质、水文条件复杂,',
											'2.缓倾斜中厚矿体、海拔标高＞3000m的高山矿床、含流砂矿床,',
											'3.有防寒保温或治理流沙设施，有露天转坑内措施,',
											'4.两种以上矿石品种或含有用元素，有矿石倒装及分采、分贮、分运设施的采矿工程,',
											'5.水深＞9m采金船或阶地采金工程 ,',
										]
									}
								]
							},
							{
								category: '选矿工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1.处理易选矿石,',
											'2.一段磨矿,',
											'3.单一选矿方法，单一产品的选矿工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1.处理两种矿石,',
											'2.两段磨矿,',
											'3.两种选矿方法，两种产品的选矿工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1.处理两种以上矿石,',
											'2.两段以上磨矿,',
											'3.两种以上选矿方法，两种以上产品,',
											'4.采用重介质、反浮选冷结晶等方法的选矿工程 ,',
										]
									}
								]
							},
							{
								category: '煤炭矿井',
								chilren:[
									{
										level:'I级',
										son:[
											'1. 地形较平坦，地质构造简单，褶曲宽缓，断层稀少，工程地质条件简单,',
											'2. 煤层、煤质稳定，全区可采，无岩浆岩侵入，无自然发火,',
											'3. 矿床充水条件简单,',
											'4. 地压、地温正常，煤层及瓦斯无突出的采矿工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1. 地形起伏不大，地质构造较复杂，褶曲、断层不影响采区划分，无不良工程地质现象,',
											'2. 煤层在可采范围内厚度变化不大，全区大部分可采，偶见少量岩浆岩，自然发火倾向小,',
											'3. 矿床充水条件较复杂，沙漠地区有溃水溃沙,',
											'4. 地压呈现强烈，地温正常，瓦斯含量低的采矿工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1. 地形复杂，地质构造复杂，褶曲、断层较密集，第四系地层稳定性差,',
											'2. 煤层倾角、厚度、煤质变化大，局部不可采，且结构复杂，有岩浆岩侵入，有自然发火危险,',
											'3. 矿床充水条件复杂，水患严重,',
											'4. 地压大，地温局部偏高，高瓦斯需抽放，煤层及瓦斯突出的采矿工程,',
										]
									}
								]
							},
							{
								category: '煤炭露天矿',
								chilren:[
									{
										level:'I级',
										son:[
											'1. 地质构造简单，矿田地形为Ⅰ类,',
											'2.煤层赋存条件属Ⅰ类，煤层单一，煤层埋藏深度≤50m,',
											'3.采用单一开采工艺，设计技术一般的采矿工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．地质构造较复杂，矿田地形为Ⅱ类,',
											'2．煤层赋存条件属Ⅱ类，煤层结构较复杂，煤质变化较大，可采煤层2层，煤层埋藏深度50～100m,',
											'3． 采用单一开采工艺，设计技术较复杂的采矿工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．地质构造复杂，矿田地形为Ⅲ类及以上,',
											'2．煤层赋存条件属Ⅲ类，煤层结构复杂，煤质变化大，可采煤层多于2层，煤层埋藏深度≥100m,',
											'3．采用综合开采工艺，设计技术复杂的采矿工程 ,',
										]
									}
								]
							},
							{
								category: '选煤厂及其他煤炭',
								chilren:[
									{
										level:'I级',
										son:[
											'1．新建筛选厂（车间）工程,',
											'2．只有井下开采的煤层气工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．新建入洗下限＞25mm选煤厂工程,',
											'2．钻井1～4层、2种井下抽放工艺、2～3个抽放系统的煤层气工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．新建入洗下限≤25mm选煤厂工程,',
											'2．钻井＞5层、3种井下抽放工艺、＞4个抽放系统的煤层气工程,',
											'3．水煤浆制备及燃烧应用工程,',
										]
									}
								]
							}
						]
					},
					{
						list:[
							{
								category:'加工冶炼工程',
								chilren:[
									{
										level:'I级',
										son:[
											'技术简单、工艺成熟、生产流程较短的一般加工及冶炼工程，主要有,',
											'1．一般机械辅机及配套厂工程,',
											'3．电子终端产品装配厂工程,',
											'4．文体用品、玩具、工艺美术品、日用杂品、金属制品厂工程,',
											'5．针织、服装厂工程,',
											'6．小型林产加工工程,',
											'7．小型冷库、屠宰厂、制冰厂，一般农业（粮食）与内贸加工工程,',
											'8．普通水泥、平板玻璃深加工、砖瓦水泥制品厂工程,',
											'9．小型、技术简单的焦化、耐火材料、烧结球团、钢铁加工及配套工程,',
											'10．小型、技术简单的建筑铝材、铜材加工及配套工程,',
										]
									},
									{
										level:'II级',
										son:[
											'工艺技术及产品结构较复杂，生产流程较长，技术含量较高的加工及冶炼工程，主要有,',
											'1．一般机械零部件加工及配套厂工程,',
											'2．造船厂、修船厂，船体加工装配、管子加工车间，3000～10000t坞修车间、船台滑道工程,',
											'3．常规兵器、光学兵器、靶厂、防化器材、民用爆破器材厂工程,',
											'4．航空辅机厂、航空零部件厂工程,',
											'5．航天零部件厂工程,',
											'6．电子元件、材料厂工程,',
											'7．简单核技术及同位素应用工程,',
											'8．食品、制盐、酿酒、烟草、皮革毛皮、家电、塑料制品、日用硅酸盐制品工程,',
											'9．棉、毛、丝、麻、纤维纺织厂工程,',
											'10．中型或者技术较复杂的林产加工工程,',
											'11．中型冷库、屠宰厂、制冰厂，技术较复杂的农业（粮食）与内贸加工工程,',
											'12．＜2000t的水泥生产线，格法、压延玻璃生产线，组合炉拉丝玻璃纤维，非金属材料，空心砖、玻璃钢、耐火材料、建筑及卫生陶瓷厂工程,',
											'13．常规技术的焦化、耐火材料、烧结球团、钢铁冶炼、加工及配套工程,',
											'14．常规技术的有色冶炼、加工及配套工程,',
										]
									},
									{
										level:'III级',
										son:[
											'工艺技术及产品结构复杂，自动化程度高，技术含量高的加工及冶炼工程，主要有,',
											'1． 机械主机制造厂，试验站（室）、试车台、动力站房、计量检测站、空分站，自动化立体和多层仓库工程,',
											'2． 船舶主机厂、特机厂，船舶工业特种涂装车间，＞10000t坞修车间、船台滑道、干船坞，船模试验水池，海洋开发工程设备厂、水声设备及水中兵器厂、精密航海仪器厂工程,',
											'3． 兵器的弹及装药、火工品、引信工程，光电、电子器件及兵器工程，坦克、装甲车、自行火炮系统的主机厂及大型装配厂工程,',
											'4．航空主机厂、装配厂、维修厂，航空试验测试工程,',
											'5．航天产品总装厂、部装厂、航天试验测试工程,',
											'6．微电子器件、显示器件、电子玻璃、电子终端产品生产厂，洁净度高于1000级的洁净厂房工程,',
											'7．铀冶炼、铀浓缩、核燃料元（组）件厂等核加工工程,',
											'8．制浆造纸、日用化学制品、日用陶瓷、塑料原料、电池、感光材料、制糖、盐化工工程,',
											'9．印染、非织造布工程,',
											'10．大型林产加工厂、技术复杂或者采用新技术的林产加工工程,',
											'12．≥2000t的水泥生产线，浮法玻璃生产线，池窑拉丝玻璃纤维、特种纤维，新型建材，特种陶瓷生产线工程,',
											'13．技术复杂的焦化、耐火材料、烧结球团、钢铁冶炼、加工及配套工程,',
											'14．技术复杂的有色冶炼、加工及配套工程，稀有金属、稀土、半导体材料冶炼及加工工程,',
										]
									}
								]
							}
						]
					},
					{
						list:[
							{
								category:'石油化工工程',
								chilren:[
									{
										level:'I级',
										son:[
											'技术一般的工程，主要包括,',
											'1．油气田井口装置和内部集输管线，油气计量站、接转站等场站、总容积＜50000m3或品种＜5种的独立油库工程,',
											'2．平原微丘陵地区长距离油、气、水煤浆等各种介质的输送管道和中间场站工程,',
											'3．工艺过程比较简单的石化、药品、无机盐生产装置工程,',
											'4．石油化工工程的辅助生产设施和公用工程,',
										]
									},
									{
										level:'II级',
										son:[
											'技术较复杂的工程，主要包括,',
											'1． 油气田原油脱水转油站、油气水联合处理站、总容积≥50000m3或品种≥5种的独立油库、天燃气处理和轻烃回收厂站、三次采油回注水处理工程,',
											'2． 山区沼泽地带长距离油、气、水煤浆等各种介质的输送管道和首站、末站、压气站、调度中心工程,',
											'3． 常压蒸馏、减压蒸馏、叠合、脱硫、脱硫醇、凝淅油回收、电精制、化学精制、氧化沥青、石蜡成型、丁烯氧化脱氢、MDPE、丁二烯抽提、乙腈、塑料薄膜、塑料地毯、塑料编织袋生产装置工程,',
											'4．磷肥、农药制剂、混配肥、工艺复杂的无机盐、普通橡胶制品工程,',
											'5.涤纶、丙纶常规切片纺丝等一般化纤工程,',
											'6．医药制剂、中药、药用材料、药品包装（外包装除外）、医疗器械生产装置，医药科研、药品检测设施工程,',
											'7．冷冻、脱盐、联合控制室、中高压热力站、环境监测、工业监视、三级污水处理工程,',
										]
									},
									{
										level:'III级',
										son:[
											'技术复杂的工程，主要包括,',
											'1． 油气田天然气液化及提氦、硫磺回收及下游装置、稠油及三次采油联合处理站、地下储气库、滩海或浅海油气田工程、石油滚动开发工程,',
											'2．复杂的油、气、水煤浆等各种介质的长输管道穿跨越工程,',
											'3.催化裂化、催化重整、加氢、制氢、常减压联合蒸馏、芳烃、MTBE、气体分馏、分子筛、脱蜡、烷基化、脱磺制硫及尾气处理、乙烯、对苯二甲酸等单体原料、合成塑料、合成橡胶、合成纤维生产装置，LPG、LNG低温储存运输设施，重油（氧化沥青除外）、润滑油加工工程,',
											'4.合成氨、制酸、制碱、复合肥生产装置，火化工，子午线轮胎、胶片、精细化工、生物化学品、复杂化纤工程,',
											'5．放射性药品、化学合成药品、抗生素药品生产装置工程,',
											'6．铀转换化工、乏燃料后处理、核三废治理、核设施退役处理工程,',
										]
									}
								]
							}
						]
					},
					{
						list:[
							{
								category:'电力、核能、水库工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．新建4台以上同容量凝汽式机组发电工程，燃气轮机发电工程,',
											'2．电压等级110kV及以下的送电、变电工程,',
											'3．设计复杂程度赋分值之和≤－20的水库和水电工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．新建或扩建2～4台单机容量50MW以上凝汽式机组及50MW及以下供热机组发电工程,',
											'2．电压等级220kV、330kV的送电、变电工程,',
											'3．设计复杂程度赋分值之和为－20～20的水库和水电工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．新建一台机组的发电工程，一次建设两种不同容量机组的发电工程，新建2～4台单机容量50MW以上供热机组发电工程，新能源发电工程（风电、潮汐等,',
											'2．电压等级500kV送电、变电、换流站工程,',
											'3．核电工程、核反应堆工程,',
											'4．设计复杂程度赋分值之和≥20的水库和水电工程,',
										]
									}
								]
							},
							{
								category:'其他水利工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1. 丘陵、山区、沙漠地区的建筑物投资之和与建设项目中所有建筑物投资之和的比例＜30%的引调水建筑物工程,',
											'2. 丘陵、山区、沙漠地区渠道管线长度之和与建设项目中所有渠道管线长度之和的比例＜30%的引调水渠道管线工程,',
											'3. 堤防等级Ⅴ级的河道治理建（构）筑物及河道堤防工程,',
											'4. 灌区田间工程,',
											'5. 水土保持工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．丘陵、山区、沙漠地区的建筑物投资之和与建设项目中所有建筑物投资之和的比例在30%～60%的引调水建筑物工程,',
											'2．丘陵、山区、沙漠地区渠道管线长度之和与建设项目中所有渠道管线长度之和的比例在30%～60%的引调水渠道管线工程,',
											'3．堤防等级Ⅲ、Ⅳ级的河道治理建（构）筑物及河道堤防工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1． 丘陵、山区、沙漠地区的建筑物投资之和与建设项目中所有建筑物投资之和的比例＞60%的引调水建筑物工程,',
											'2． 丘陵、山区、沙漠地区管线长度之和与建设项目中所有渠道管线长度之和的比例＞60%的引调水渠道管线工程,',
											'3．堤防等级Ⅰ、Ⅱ级的河道治理建（构）筑物及河道堤防工程,',
											'4．护岸、防波堤、围堰、人工岛、围垦工程，城镇防洪、河口整治工程,',
										]
									},
								]
							}
						]
					},
					{
						list:[
							{
								category:'公路、城市道路、轨道交通、索道工程',
								chilren:[
									{
										level:'I级',
										son:['1．三级、四级公路及交通安全设施、道班房工程,']
									},
									{
										level:'II级',
										son:[
											'1．二级公路及交通安全设施、收费系统及管理养护服务设施工程,',
											'2．城市街区道路、次干路工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．高速公路、一级公路工程,',
											'2.高速公路、一级公路的交通安全设施、监控系统、通信系统、收费系统及管理养护、服务设施工程,',
											'3．城市主干路、快速路、城市地铁、轻轨、广场、停车场工程,',
											'4．客（货）运索道工程,',
										]
									},
								]
							},
							{
								category:'公路和城市桥梁、隧道工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1． 总长＜1000m，水深＜15m，单孔跨径为30～50m的预应力混凝土简支梁，30～50m的预应力混凝土连续箱梁等大桥工程,',
											'2．地质构造简单，长度＜500m的隧道工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1． 总长＞1000m，水深＞15m，单孔跨径为30～50m的预应力混凝土简支梁、30～100m的预应力混凝土连续箱梁等大桥工程,',
											'2．地质构造简单，长度在500～1000m的隧道工程,',
											'3．城市立交桥、人行天桥、地下通道、涵洞工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．总长＞1000m，水深＞15m，单孔跨径为＞250m的预应力混凝土连续结构和钢筋混凝土拱桥，跨度400～1000m的斜拉桥、800～1500m的悬索桥等大桥工程,',
											'2．地质构造复杂，长度＞1000m的隧道工程,',
											'3．全苜蓿叶型、双喇叭型、枢纽型等各类独立的互通式立体交叉工程,',
										]
									},
								],
							},
							{
								category:'水运工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．＜1000t级的码头工程,',
											'2．＜300t级的船闸工程，＜100t级的升船机工程,',
											'3．内河＜300t级和沿海＜5000t级的航道工程,',
											'4．各类疏浚、吹填、造陆工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．1000～10000t级的码头工程,',
											'2．＜1000t级的渔业、油、汽、危险品码头工程,',
											'3．300～1000t级的船闸工程，100～500t级的升船机工程,',
											'4．内河300～1000t和沿海5000～30000t级航道工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．＞10000t级的码头工程,',
											'2．≥1000t级的渔业、油、气、危险品码头工程,',
											'3．离岸孤立建筑物、单点（多点）系泊工程与开敞式码头工程,',
											'4．＞1000t级的船闸工程，＞500t级的升船机工程,',
											'5．内河＞1000t级和沿海＞30000t级航道工程,',
											'6．各类水上交通管制工程,',
										]
									},
								]
							},
							{
								category:'民用机场工程',
								chilren:[
									{
										level:'I级',
										son:[
											'场道及空中交通管制工程：3C及以下,',
											'助航灯光工程：Ⅰ类及以下,',
										]
									},
									{
										level:'II级',
										son:[
											'场道及空中交通管制工程：4D、4C,',
											'助航灯光工程：Ⅱ类,',
										]
									},
									{
										level:'III级',
										son:[
											'场道及空中交通管制工程：4E及以上,',
											'助航灯光工程：Ⅲ类,',
										]
									},
								]
							},
						]
					},
					{
						list:[
							{
								category:'建筑、人防工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．功能单一、技术要求简单的小型公共建筑工程,',
											'2．高度＜24m的一般公共建筑工程,',
											'3．小型仓储建筑工程,',
											'4．简单的设备用房及其他配套用房工程,',
											'5．简单的建筑环境设计及室外工程,',
											'6．相当于一星级饭店及以下标准的室内装修工程,',
											'7．人防疏散干道、支干道及人防连接通道等人防配套工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．大中型公共建筑工程,',
											'2．技术要求较复杂或有地区性意义的小型公共建筑工程,',
											'3．高度24～50m的一般公共建筑工程,',
											'4．20层及以下一般标准的居住建筑工程,',
											'5．仿古建筑、一般标准的古建筑、保护性建筑以及地下建筑工程,',
											'6．大中型仓储建筑工程,',
											'7．一般标准的建筑环境设计和室外工程,',
											'8．相当于二、三星级饭店标准的室内装修工程,',
											'9．防护级别为四级及以下同时建筑面积＜10000m2的人防工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．高级大型公共建筑工程,',
											'2．技术要求复杂或具有经济、文化、历史等意义的省（市）级中小型公共建筑工程,',
											'3．高度＞50m的公共建筑工程,',
											'4．20层以上居住建筑和20层及以下高标准居住建筑工程,',
											'5．高标准的古建筑、保护性建筑和地下建筑工程,',
											'6．高标准的建筑环境设计和室外工程,',
											'7．相当于四、五星级饭店标准的室内装修，特殊声学装修工程,',
											'8．防护级别为三级以上或者建筑面积≥10000m2的人防工程,',
										]
									}
								]
							},
							{
								category:'园林绿化工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．一般标准的道路绿化工程,',
											'2．片林、风景林等工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．标准较高的道路绿化工程,',
											'2．一般标准的风景区、公共建筑环境、企事业单位与居住区的绿化工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．高标准的城市重点道路绿化工程,',
											'2．高标准的风景区、公共建筑环境、企事业单位与居住区的绿化工程,',
											'3.公园、渡假村、高尔夫球场、广场、街心花园、园林小品、屋顶花园、室内花园等绿化工程,',
										]
									}
								]
							},
							{
								category:'市政公用、园林绿化工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．庭院户内燃气管道工程,',
											'2．一般给排水地下管线（DN＜1.0m，无管线交叉）工程,',
											'3．小型垃圾中转站，简易堆肥工程,',
											'4．供热小区管网（二级网）工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．城市调压站，瓶组站，＜5000户气化站、混气站，＜500m3储配站工程,',
											'2．城区给排水管线，一般地下管线(DN＜1.0m，有管线交叉)，＜1 m3/s加压泵站，简单构筑物工程,',
											'3．＞100t/天的大型垃圾中转站，垃圾填埋场、机械化快速堆肥工程,',
											'4．≤2MW的小型换热站工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．城市超高压调压站，市内管线及加压站，穿、跨越管网， ≥5000户气化站、混气站，≥500m3储配站、门站、气源厂、加气站工程,',
											'2．大型复杂给排水管线，市政管网，大型泵站、水闸等构筑物，净水厂，污水处理厂工程,',
											'3．垃圾系统工程及综合处理与利用、焚烧工程,',
											'4．锅炉房，穿、跨越供热管网，＞2MW换热站工程,',
											'5．海底排污管线，海水取排水、淡化及水处理工程,',
										]
									}
								]
							},
							{
								category:'广播电视、邮政、电信工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．广播电视中心设备（广播1套，电视1～2套）工程,',
											'2．中波发射台设备（单机功率P≤1kW）工程,',
											'3．短波发射台设备（单机功率P≤50kW）工程,',
											'4．电视、调频发射塔(台)设备（单机功率P≤1kW）工程,',
											'5．广播电视收测台设备工程,',
											'6．三级邮件处理中心工艺工程,',
											'7．简单的电信工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．广播电视中心设备（广播2～3套，电视3～5套）工程,',
											'2．中波发射台设备(单机功率1kW＜P≤20kW）工程,',
											'3．短波发射台设备（单机功率50kW＜P≤150kW）工程,',
											'4．电视、调频发射塔(台)设备（单机功率1kW＜P≤10kW，塔高＜200m）工程,',
											'5．广播电视传输网络工程,',
											'6．二级邮件处理中心及各类转运站工艺工程,',
											'7．较复杂的电信工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．广播电视中心设备（广播4套以上，电视6套以上）工程,',
											'2．中波发射台设备（单机功率P＞20kW）工程,',
											'3．短波发射台设备（单机功率P＞150kW）工程,',
											'4．电视、调频发射塔(台)设备（单机功率P＞10kW，塔高≥200m）工程,',
											'5．电声设备、演播厅、录(播)音馆、摄影棚设备工程,',
											'6．广播电视卫星地球站、微波站设备工程,',
											'7．广播电视光缆、电缆节目传输工程,',
											'8．一级邮件处理中心工艺工程,',
											'9．复杂的电信工程,',
										]
									}
								]
							}
						]
					},
					{
						list:[
							{
								category:'农业、林业工程',
								chilren:[
									{
										level:'I级',
										son:[
											'1．平原区高差＜5m或坡降＜1/500、土壤水文地质条件一般的农业综合开发工程,',
											'2．机械化程度较低、环境控制简单的畜牧场工程,',
											'3．地形与水文条件简单、给排水系统简易的水产养殖工程,',
											'4．生态农业工程、旱作农业工程，草原三化治理工程,',
											'5．高差＜500m的丘陵地区、林区边缘距公路或铁路＜20km，总面积＜150000ha、设计年产量＜100000m的林场的林业局（场）总体设计、木材运输和贮木场工程,',
											'6．规模较小、技术难度小的其他林业工程,',
										]
									},
									{
										level:'II级',
										son:[
											'1．丘陵地区高差5～50m或坡降1/500～1/100、土壤水文地质条件较差的农业综合开发工程,',
											'2．饲养管理、环境控制半自动化的畜牧场工程,',
											'3．地形与水文条件及给排水系统复杂、有人工孵化、温室育苗等设施的水产养殖工程,',
											'4．一般生产型温室及农业设施工程,',
											'5．高差在500～1000m的山区、林区边缘距公路或铁路20～30km、总面积为150000～350000ha、设计年产量为100000～300000m3的林业局（场）总体设计、木材运输和贮木场工程,',
											'6．规模较中等、技术难度较大、工作环境较差的其他林业工程,',
										]
									},
									{
										level:'III级',
										son:[
											'1．山区高差＞50m或坡降＞1/100、土壤水文地质条件差的农业综合开发工程,',
											'2．饲养管理、环境控制全自动化或采用新工艺新技术的畜牧场工程,',
											'3．采用工厂化养殖、水循环回用、自动化程度高的水产养殖工程,',
											'4．较复杂的科研或观光型温室及农业设施工程,',
											'5．差高＞1000m的高山地区、林区边缘距公路或铁路＞30km，总面积＞350000ha、年产量＞300000m3的林业局（场）总体设计、木材运输和贮木场工程,',
											'6．规模较大、技术复杂、工作环境差或有特殊工艺要求的其他林业工程,',
										]
									}
								]
							}
						]
					}
				],
				dataList:['2.矿山采选工程','3.加工冶炼工程','4.石油化工工程','5.水利电力工程','6.交通运输工程','7.建筑市政工程','8.农业林业工程'],
				check:[]
			}
		},
		components: {
			uniCollapse,
			uniCollapseItem,
		},
		methods:{
			addClass(index){
				this.clickIndex = index
			},
			change(e){
				this.check = e
				this.isactive = e[0]
				this.clickIndex = 0 
			}
		},
		computed:{
			checkOpen(){
				return this.check.length
			}
		}
	}
</script>

<style scoped>
	.bnb {
		border: 2rpx solid #00a0e0;
		border-bottom: none;
	}
	.active {
		background: #3788e4;
		color: #fff;
	}
</style>